/*- Є змінна х, якій ви надаєте довільне числове значення.
    Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3*/
let x = +prompt('Введіть число');
if (x != 0) {
    console.log('Правильно');
} else{
    console.log('Неправильно');
}

/*- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
(в першу, другу, третю или четверту частину години).*/
let time = +prompt('Введіть число');
if (time>=0 && time<=15){
    console.log('Перша чверть');
} else if(time>15 && time<=30){
    console.log('Друга чверть');
}else if(time>30 && time<=45){
    console.log('Третя чверть');
}else if(time>45 && time<=59){
    console.log('Четверта чверть');
}else{
    console.log('Перевірте чи ваше число належить проміжку від 0 до 59');
}

/*- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).*/
let day = +prompt('Введіть число');
if (day>=1 && day<=10){
    console.log('Перша декада');
} else if(day>10 && day<=20){
    console.log('Друга декада');
}else if(day>20 && day<=31){
    console.log('Третя декада');
}else{
    console.log('Перевірте чи ваше число належить проміжку від 0 до 31');
}
/*- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).*/
 let numday = +prompt('Введіть порядковий номер дня тижня');
 switch(numday){
     case 1:
         console.log('Monday');
         break;
     case 2:
         console.log('Tuesday');
         break;
     case 3:
         console.log('Wednesday');
         break;
     case 4:
         console.log('Thursday');
         break;
     case 5:
         console.log('Friday');
         break;
     case 6:
         console.log('Saturday');
         break;
     case 7:
         console.log('Sunday');
         break;
     default:
         console.log('Перевірте чи ваше число належить проміжку від 1 до 7');
 }
/* - Користувач вводить або має два числа.
     Потрібно знайти та вивести максимальне число з тих двох .
     Також потрібно врахувати коли введені рівні числа.*/
let n = +prompt('Введіть перше число');
let m = +prompt('Введіть друге число');
if (n>m){
    console.log(n);
} else if(n<m){
    console.log(m);}
else if(n==m){
    console.log('Рівні');}
/*- є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
    за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)*/
let xx = prompt() || 'default'
console.log(xx)